// عند تحميل الصفحة قم بتنفيد الاكواد او الشيفرة التي هي بداخل هاته الوظيفة او الدالة 
$(document).ready(function(){
  // قم باعطاء الصنف active للعنصر الدي يملك الصنف first-list-element
  // قمنا بهاته العملية عن طريق التابع addclass والدي مهمته هي اضافة صنف ما لعنصر ما نريده
  $(".first-list-element").addClass("active");
// عند الضغط على العنصر الدي يمتلك الصنف nav-item قم بتنفيد الدالة التالية 
  $(".nav-item").click(function(){
    // احدف الصنف active من الزر الدي لديه الصنف nav-item 
    $(".nav-item").removeClass("active");
    // اضف الصنف active الى الزر الدي ضغط عليه 
    $(this).addClass("active");
  });
// عند الضغط على العنصر الدي يملك المعرف toggler قم بتنفيد الوظيفة التالية
    $("#toggler").click(function(event){
      // عند الضغطة الاولى قم باظهار القائمة التي تملك المعرف #wrap واظهر الصنف togled
      // الصنف toggled لا يوجد ضمن ملف html انما يوجد ضمن ملف التنسيقات css وهو يظهر ويختفي حسب عدد الضغطات
      $('#wrap').toggleClass('toggled');
// هنا قمنا يتحديد خاصية right عن طريق التابع css ومن ملف css
// وقمنا باعطائه متغير خاص ودلك حتى نتمكن من اعطائه وظائف الجافاسكرسبت التي نريد
      var right = $('.sidebar').css("right");
      // ادا كان العنصر دو المتغير right يساوي 0 
      if(right == '0px')
      {
        // هنا قمنا بتحديد القائمة الجانبية ومن تم وعن طريق التابع css قمنا باعطاء القيمة -17 للخاصية right 
        // الان الدي سيحدث الا وهو ان القائمة ادا كانت ظاهرة وعند ما يضغط المستخدم ستختفي
        $('.sidebar').css({'right': '-17rem'});
        // هنا قمنا بتحديد العنصر الدي هو الظل والدي يملك الصنف layer 
        // وعن طريق الدالة fadeOut تمكنا من اخفاء الظل تزامنا مع اختفاء القائمة الجانبية sidebar
        $('.layer').fadeOut();
      }
      else{
        // ادا كانت القائمة الجانبية غير ظاهرة قم باظهارها
        // قمنا يهاته العملية عن طريق اعطاء الخاصية right قيمة0
        $('.sidebar').css({'right': '0'});
        // هنا وعبر الدالة fadeIn قمنا باظهار الظل تزامنا مع ظهور القائمة الجانبية
        $('.layer').fadeIn();
      }
    });
// عند الضغط على الظل الاسود قم بتطبيق الوظيفة التالية
    $('.layer').click(function(){
      // قم باخفاء القائمة الجانبية
      $('.sidebar').css({'right': '-17rem'});
      // قم باخفاء الظل الاسود
      $('.layer').fadeOut();
    });
// عند الضغط على العنصر الدي لديه الصنف search-icon قم بتنفيد الوظيفة التالية
    $(".search-icon").click(function(){
      // هنا قمنا بتحديد حقل الادخال ودلك عن طريق الصنف الخاص به search-input
      // وعن طريق الدالة slideToggle دات الميزة slow تمكنا من فتح الحقل من الاعلى وغلقه من الاسفل
      $(".search-input").slideToggle("slow");
    });
});