$(document).ready(function(){
    // ولكي تتنفد التعليمات التي بالسفل قلنا له انه عند الضغط على العنصر الدي يملك المعرف mybtn
    $("#myBtn").on("click", function(){
        // قم بتنفيد الوظيفة read
        read();
    });
// عند الضغط على العنصر الدي يملك الصنف reply قم بتنفيد الدالة التالية
    $(".reply").click(function(){
        // هنا قمنا في بادئ الامر بتحديد التعليق الدي ضغط عليه
        //هنا عن طريق الخاصية this قمنا بتحديد الزر الدي ضغطنا عليه
        // ثم بعدها قمنا بتحديد العنصر الاب لهادا الزر ودلك طريق الاصناف التي يمتلكها الاب div.row
        // وعن طريق التابع next قمنا بتحديد العنصر الدي يحتوي على الرد
        // ودلك عن طريق تحديد العنصر الاب والدي يملك الاصناف div.card
        // وفي الاخير ولكي تعمل هاته التعليمات 
        // وجب الاعتماد على التابع toggle والدي مهمته هي اظهار واخفاء التعليق
        $(this).parents("div.row").next("div.card").toggle();
    });
});
// هنا قمنا بانشاء وظيفة وقمنا بتسميتها read
function read(){
    // هنا قمنا باحضار العنصر الدي يحتوي على المعرف dots
    // ثم بعد دلك قمنا باعطائه متغير خاص به ضمن هاته الدالة
    // هادا المتغير قمنا بتعيينه للنقاط الثلات
    var dots = document.getElementById("dots");
    // نفس الخطوات التي سبقت سننجزها على العنصر الدي يملك المعرف more
    // المتغير more قمنا باسناده للنص الدي نريد اظهاره واخفائه
    var moreText = document.getElementById("more");
    // المتغير btntext قمنا باسناده للزر الدي سنضغط عليه للتحكم في النص اما اظهاره او اخفائه
    var btnText = document.getElementById("myBtn");
// ادا كانت النقاط الثلات مخفية 
// وقد عبر عنها ب display===none
// ولا ننسى الخاصية التي تربط كل هادا وهي style
    if(dots.style.display === "none"){
        // اظهر النقاط الثلات
        // والدي نفهمه بعد كل هادا ان النص كان ظاهرا والنقاط مخفية 
        // وبعد قيامنا بهاته التعليمات قمنا باخفاء النص واظهار النقاط ادا كانت مخفية
        dots.style.display = "inline";
        // هنا قمنا باستبدال محتوى النص لكي يتوافق مع التعليمات التي قمنا بها فوق
        // وعن طريق الخاصية innerhtml قمنا بتغيير النص من عرض عناصر اقل الى عرض المزيد
        btnText.innerHTML = "عرض المزيد";
        // هنا قمنا باخفاء النص لانه ومن طبيعة سريان الكود فوق فقد قمنا باظهار النقاط الثلات
        // لدا يجب علينا اخفاء النص
        moreText.style.display = "none";
        // هنا ننتقل للشرط التاني 
        // هنا قلنا له ادا كانت النقاط الثلات ظاهرة والنص مخفي 
    }else{
        // قم باخفاء النقاط الثلات 
        // والدي نفهمه ان النقاط الثلاث كانت ظاهره وقمنا باخفائها
        dots.style.display = "none";
        // هنا قمنا بتغيير محتوى النص الدي بالزر لكي يتوافق مع التعليمات السابقة
        // وعن طريق  الخاصية innerhtml قمنا بتغيير محتوى النص من عرض المزيد الى عرض عناصر اقل
        btnText.innerHTML = "عرض عناصر اقل";
        // هنا قمنا باظهار النص 
        // لانه ومن طبيعة سريان ومجريات التعليمات في هاته الحالة يجب ان يكون النص ظاهرا
        moreText.style.display = "inline";
    }
}